# `Module - Python`

### 1 )  What will be the out put of the following python program 

1. error 
2. none
3. False
4. True 

#### option 4 is correct

In [1]:
def foo(x):    #def foo(x)--> This line defines a function named foo that takes a single parameter x.
    x[0]=['def'] #x[0]=['def']-->Modifies the first element of the list x to be a new list containing the string 'def'.
    x[1]=['abc']#x[1]=['abc']-->Modifies the second element of the list x to be a new list containing the string 'abc'.
    return id(x)#return id(x)-->Returns the id of the modified list x.
q=['abc','def']#q-->is a list containing two string elements: ['abc' and 'def'].
print(id(q)==foo(q))

True

### 2 ) what will be the output of the following python code ?

1. error,there is more than one return statement in a single try finally block
2. 1
3. 1 2
4. 2

#### option 4 is correct

In [2]:
def fun():
    try:
        return 1  #The finally block always executes, and in this case, 
                  #it overrides the return value from the try block, so the function returns 2.
    finally:
        return 2
k=fun()
print(k)

2

### 3 ) what will be the output of the following code snippet ?

1. Local
2. Global
3. None
4. Cannot be predictable 

#### option 1 is correct

In [3]:
# explanation
def func():  #func() is called, which has a global declaration for value, making it a global variable within the function.
    global value
    value = "Local" #Inside the function, value is assigned the string "Local."
value = "Global"#value is initially assigned the string "Global" in the global scope.
func()
print(value) #When print(value) is executed outside the function.it prints the globally scoped value, which was modified inside the function.

Local

### 4 ) _______ expectations are raised as a result of an error in opening a particular file.

1. Vlaue Error
2. TypeError
3. ImportError 
4. IOError 

#### option 4 is correct

In [4]:
#The specific type of exception that is raised when there's an issue with opening a file is called an IOError.

### 5 ) In python we do not specify types, it is directly interpreted by the compiler , so consider the following opeations to be performed.

1. x= 13//2
2. x= int(13/2)
3. x=13%2
4. all of the mentioned

#### option 4 is correct

In [5]:
x=13//2 ## it is directly interpreted by the compiler

In [6]:
x=int(13/2)

In [7]:
x=13%2

### 6 ) what will be the output of the following python code 
1. index error
2. name error
3. value erro
4. syntactical error

#### option 2 is correct

In [8]:
t[5] #t[5] will raise a NameError if t is not defined, and it will raise an IndexError if t is defined but doesn't have an element at index 5.

NameError: name 't' is not defined

### 7 ) A while loop in python is used for what type of iteration.
1. indefinite
2. discriminant
3. definite
4. indeterminate

#### option1 is correct

In [69]:
# In Python, indefinite iteration is performed with a while loop.

### 8 ) what will be the output of the following python code ?
1. a b c d e 
2. abcde
3. i i i i i i i
4. Error

#### option 4 is correct

In [70]:
x = " abcde "
while i in x: # The while loop in Python is typically used with a condition that evaluates to either True or False.
    print(i,end=" ")

NameError: name 'i' is not defined

### 9 ) what is the main advantages of using decorators in python ?

1. They make the code more complex 
2. They simplify the syntax of the decorated.
3. They reduce the performance of the code.
4. They provide additional security features.

#### option 2 is correct

In [71]:
# The main advantage of using decorators in Python is that they simplify the syntax of the decorated functions.

### 10 ) if return statement is not used inside the funciton,the funciton will return : 

1. None 
2. 0
3. Null
4. Arbitary Value

#### opition 1 is correct

In [72]:
#If a return statement is not used inside the function, it will return None by default.

### 11 ) what is called when a function is defined inside a class ?
1. class 
2. function
3. method 
4. module 
#### option 3 is correct

In [73]:
#When a function is defined inside a class in Python, it is called a method.

### 12 ) Which operator is used in python to import modules from packages ?
1.    .
2.    *
3.   ->
4.   &

#### option 1 is correct

In [74]:
# In Python, the dot (.) operator is used to import modules from packages. The syntax typically involves specifying the package name followed by a dot and then the module name.

### 13 )

In [75]:
def GetMonth(m): ## writing function which accepts a one argument
    if m<1 or m>12: ## its checking wheather the given argument is in between 1 to 12 ,if it is true it goes for print statement
        raise ValueError ("Invalid") ### if we give below 1 and above 12 it throws an error as invalid
    print(m)

In [76]:
GetMonth(6)

6

In [77]:
#GetMonth(0),#GetMonth(15)

### 14 ) in the python programming language syntax error is detected by ___at ____

1. Interpreter / Compile time 
2. Run time / interpreter 
3. interpreter / Run time
4. Compile time / Run time

#### option 3 is correct

### 15 ) 
1. both book1 and book2 will have refernece to two different of class Book
2. id(book1) and id(book2) will have same value 
3. it will throw error as multiple reference to object is not possible 
4. None of the above 

#### option 2 is correct

In [78]:
class Book:
    def __init__(self,author):
        self.author=author
book1=Book("V.M.Shah")
book2=book1

In [79]:
#book2 = book1 makes both book1 and book2 refer to the same Book object, so id(book1) and id(book2) have identical values, representing the shared reference to the object.

In [80]:
id(book1)

2252210265616

In [81]:
id(book2)

2252210265616

In [82]:
import pandas as pd

In [83]:
data=pd.DataFrame({'date':['2024-01-01','2024-01-02','2024-01-03','2024-01-10','2024-01-9','2024-01-8'],
             'Category':['Beverage','Food','Beverage','Beverage','Beverage','Food'],
             'Product':['Cappuccino','Croissant','Espresso','Latte','Lattle','Muffin'],
             'Customer-Id':['C004','C002','C001','C001','C003','C002'],
             'Quantity':[1,2,2,3,1,1,],
             'UnitPrice':[3,2,2,3.5,3.5,2.5]})

In [84]:
data

         date  Category     Product Customer-Id  Quantity  UnitPrice
0  2024-01-01  Beverage  Cappuccino        C004         1        3.0
1  2024-01-02      Food   Croissant        C002         2        2.0
2  2024-01-03  Beverage    Espresso        C001         2        2.0
3  2024-01-10  Beverage       Latte        C001         3        3.5
4   2024-01-9  Beverage      Lattle        C003         1        3.5
5   2024-01-8      Food      Muffin        C002         1        2.5

In [85]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         6 non-null      object
 1   Category     6 non-null      object
 2   Product      6 non-null      object
 3   Customer-Id  6 non-null      object
 4   Quantity     6 non-null      int64
 5   UnitPrice    6 non-null      float64
dtypes: float64(1), int64(1), object(4)
memory usage: 420.0+ bytes

In [86]:
x=pd.to_datetime(data['date'])

In [87]:
data['Date_column']=x

In [88]:
data

,date,Category,Product,Customer-Id,Quantity,UnitPrice,Date_column
0,2024-01-01,Beverage,Cappuccino,C004,1,3.0,2024-01-01
1,2024-01-02,Food,Croissant,C002,2,2.0,2024-01-02
2,2024-01-03,Beverage,Espresso,C001,2,2.0,2024-01-03
3,2024-01-10,Beverage,Latte,C001,3,3.5,2024-01-10
4,2024-01-9,Beverage,Lattle,C003,1,3.5,2024-01-09
5,2024-01-8,Food,Muffin,C002,1,2.5,2024-01-08

### 16 ) How to create a new column 'Revenue' ,which has value equals to the quantity * unitprice of the current row 
1. df['Revenue'] = df['Quantity'] * df['UnitPrice']
2. df['Revenue'] = df.apply(lambda x:x['Quantity'] * x['UnitPrice'],axis=1)
3. df['Revenue'] = df.apply(lambda x:x['Quantity'] * x['UnitPrice'],axis=0)
3. df['Revenue'] = df['Quantity'] ** df['UnitPrice']

##### 1,2 both options are right

In [89]:
data['Revenue']=data['Quantity'] * data['UnitPrice']#This line creates a new 'Revenue' column in the DataFrame by computing the product of 'Quantity' and 'UnitPrice' for each row.

In [90]:
data

,date,Category,Product,Customer-Id,Quantity,UnitPrice,Date_column,Revenue
0,2024-01-01,Beverage,Cappuccino,C004,1,3.0,2024-01-01,3.0
1,2024-01-02,Food,Croissant,C002,2,2.0,2024-01-02,4.0
2,2024-01-03,Beverage,Espresso,C001,2,2.0,2024-01-03,4.0
3,2024-01-10,Beverage,Latte,C001,3,3.5,2024-01-10,10.5
4,2024-01-9,Beverage,Lattle,C003,1,3.5,2024-01-09,3.5
5,2024-01-8,Food,Muffin,C002,1,2.5,2024-01-08,2.5

In [91]:
# data['Revenue'] = data.apply(lambda x:x['Quantity'] * x['UnitPrice'],axis=0)
## uncomment to see an error ,it was wrong because axis=0 (column wise),that's why, it cannot multiply

In [92]:
data['Revenue'] = data.apply(lambda x:x['Quantity'] * x['UnitPrice'],axis=1) 
## it multiplies the quantity and unitprice ,by taking axis as 1 ,axis=1 (row wise)

In [93]:
data

,date,Category,Product,Customer-Id,Quantity,UnitPrice,Date_column,Revenue
0,2024-01-01,Beverage,Cappuccino,C004,1,3.0,2024-01-01,3.0
1,2024-01-02,Food,Croissant,C002,2,2.0,2024-01-02,4.0
2,2024-01-03,Beverage,Espresso,C001,2,2.0,2024-01-03,4.0
3,2024-01-10,Beverage,Latte,C001,3,3.5,2024-01-10,10.5
4,2024-01-9,Beverage,Lattle,C003,1,3.5,2024-01-09,3.5
5,2024-01-8,Food,Muffin,C002,1,2.5,2024-01-08,2.5

### 17 ) what is the syntax to find categorical wise revenue ? 
1. df.groupby('Category')['Revenue'].mean()
2. df.groupby('Category')['Revenue'].sum()
3. df.groupby('Category')['Revenue'].agg(np.sum)
4. df.groupby('Category')['Revenue'].agg('sum')

#### for the above question 2,3,4 are correct options

In [94]:
data.groupby('Category')['Revenue'].sum()

Category
Beverage    21.0
Food         6.5
Name: Revenue, dtype: float64

In [95]:
data.groupby('Category')['Revenue'].agg('sum')

Category
Beverage    21.0
Food         6.5
Name: Revenue, dtype: float64

In [96]:
import numpy as np

In [97]:
data.groupby('Category')['Revenue'].agg(np.sum)

Category
Beverage    21.0
Food         6.5
Name: Revenue, dtype: float64

In [98]:
data.groupby('Category')['Revenue'].mean() ## it gives average

Category
Beverage    5.25
Food        3.25
Name: Revenue, dtype: float64

### 18 ) to find the average quantity wrt to date and product,what is the correct syntax ?(
1. df.groupby(['Date','Product'])['Quantity'].avg()
2. df.groupby(['Date','Product'])['Quantity'].mean()
3. df.groupby(['Product','Date'])['Quantity'].avg()
4. df.groupby(['Product','Mean'])['Quanity'].mean()
#### option 2 is correct

In [99]:
data.groupby(['Date_column','Product'])['Quantity'].mean() #This syntax groups the DataFrame by 'Date' and 'Product' and calculates the mean of 'Quantity' for each combination.

Date_column  Product
2024-01-01   Cappuccino    1.0
2024-01-02   Croissant     2.0
2024-01-03   Espresso      2.0
2024-01-08   Muffin        1.0
2024-01-09   Lattle        1.0
2024-01-10   Latte         3.0
Name: Quantity, dtype: float64

### 19 ) Categorical wise revenue for beverage and food respectively are 

1. 28.5,6.0
2. 6.0,27.5
3. 28.5,7.0
4. 7.0,28.5

In [100]:
beverage_revenue = data[data['Category'] == 'Beverage']['Revenue'].sum()
food_revenue = data[data['Category'] == 'Food']['Revenue'].sum()
print("Beverage Revenue:", beverage_revenue)
print("Food Revenue:", food_revenue)

Beverage Revenue: 21.0
Food Revenue: 6.5

### 20 ) using transform what is the syntax to create a column which has a unitprice difference wrt its category mean ?

1. df.groupby('Category')['UnitPrice'].transform(lambda x:x-x.mean())
2. df.groupby('Category')('UnitPrice').transform(lambda x:x-x.mean())
3. df.groupby['Category']['UnitPrice'].transform(lambda x:x-x.mean())
4. df.groupby(['Category','UnitPrice']).transform(lambda x:x-x.mean())

#### option 1 is correct

In [101]:
data.groupby('Category')['UnitPrice'].transform(lambda x:x-x.mean())#The syntax calculates a new column by subtracting the mean of 'UnitPrice' within each 'Category' using the transform function in a grouped DataFrame.

0    0.00
1   -0.25
2   -1.00
3    0.50
4    0.50
5    0.25
Name: UnitPrice, dtype: float64

### 21 ) what is the correct syntax to get data wrt 'Monday'.

1. df.groupby(df.Date.dt.day_name()).get_groupby('Monday')
2. df.groupby(df.Date.dt.dayname()).get_group('Monday')
3. df.groupby(df.Date.dt.dayofweek()).get_groupby('Monday')
4. df.groupby(df.Date.dt.day_of_week()).get_group('Monday')

#### option 1 is correct

In [102]:
data.groupby(data.Date_column.dt.day_name()).get_group('Monday')#This syntax groups the DataFrame by the day name of the 'Date' column and retrieves the data for 'Monday' using get_group.

,date,Category,Product,Customer-Id,Quantity,UnitPrice,Date_column,Revenue
0,2024-01-01,Beverage,Cappuccino,C004,1,3.0,2024-01-01,3.0
5,2024-01-8,Food,Muffin,C002,1,2.5,2024-01-08,2.5

In [103]:
#data.groupby(data.Date_column.dt.dayname()).get_group('Monday')
## it throws an error because ,we dont have " dayname " attribute for dt method

In [104]:
#data.groupby(data.Date_column.dt.dayofweek()).get_groupby('Monday')
 ## it throws an error (Type Error )

### 22 ) which of the following statements is/are True ? 

1. apply() can be applied on rows 
2. apply function can't be applied on rows 
3. apply applies the function on the entire series at a time.
4. apply apllies the function one cell at a time.

#### 1,3 options are correct

In [105]:
#1,3 options are correct,The apply() function in pandas applies the provided function to each cell, not just the entire series or rows.

### 23 ) Which of the following statement is/are True ?

1. Map applies the functionality on entire data Frame
2. applymap applies the functionality on series be it row or a column
3. apply and map are vectorized applications 
4. none of the above 

#### none of the above

In [106]:
df1=pd.DataFrame({'Date':['2024-01-10','2024-01-11','2024-01-10','2024-01-12','2024-01-11','2024-01-12'],
                 'Region':['North','South','East','West','North','East'],
                 'Salesperson':['Ajay','Balu','Chirag','Ajay','Balu','Chirag'],
                 'Product':['Notebook','Pen','Notebook','Pen','Binder','Binder'],
                 'Quantity':[5,10,7,15,20,10],
                 'Untprice':[12,3,12,3,5,5]})

In [107]:
df1

         Date Region Salesperson   Product  Quantity  Untprice
0  2024-01-10  North        Ajay  Notebook         5        12
1  2024-01-11  South        Balu       Pen        10         3
2  2024-01-10   East      Chirag  Notebook         7        12
3  2024-01-12   West        Ajay       Pen        15         3
4  2024-01-11  North        Balu    Binder        20         5
5  2024-01-12   East      Chirag    Binder        10         5

### 24 ) what is the syntax to create a pivot table with indedx as north and south and columns as product where values are sum of quantites sold ?

1. df1[df1['Region'].isin(['North','South']).pivot_table(index='Product',columns='Product',values='Quantity',agg='sum')
2. df1[df1['Region'].isin(['North','South']).pivot_table(index='Product',columns='Product',values='Quantity',aggfun='sum')
3. df1[(df1['Region']=='North')|(df1['Region']=='South')]).pivot_table(index='Product',columns='Product',values='Quantity',agg='sum')
4. df1[(df1['Region']=='North')|(df1['Region']=='South')]).pivot_table(index='Product',columns='Product',values='Quantity',aggfun='sum')

In [108]:
### above option are not correct

In [109]:
df1[df1['Region'].isin(['North','South'])].pivot_table(index='Region',columns='Product',values='Quantity',aggfunc='sum')

Product  Binder  Notebook   Pen
Region
North      20.0       5.0   NaN
South       NaN       NaN  10.0

In [110]:
#df1[df1['Region'].isin(['North','South'])].pivot_table(index='Product',columns='Product',values='Quantity',agg='sum')
## we dont have agg parameter in pivot_table

In [111]:
#df1[(df1['Region']=='North')|(df1['Region']=='South')]).pivot_table(index='Product',columns='Product',values='Quantity',agg='sum')
## we dont have agg parameter in pivot_table

In [112]:
#df1[(df1['Region']=='North')|(df1['Region']=='South')].pivot_table(index='Product',columns='Product',values='Quantity',aggfunc='sum')

### 25 ) which of the following statements is/are True ? 

1. .iloc method includes the last element when used for slicing 
2. .loc method doesnt includes the last element when used for slicing
3. we can use .loc method and pass default integer index of rows when slicing 
4. None of the above 

#### both 1,3 arecorrect

In [113]:
#.iloc method includes the last element when used for slicing.
# True. The .iloc method is based on integer-location indexing and includes the last element when used for slicing.
#.loc method doesn't include the last element when used for slicing.

# we can use .loc method and pass default integer index of rows when slicing

# True. The .loc method allows you to slice based on the label/index of rows, and if the default integer index is used, it will work as well.

### 26 ) Using a pivot table is it possible to create a multi-index data frame,if so what is the syntax to have a multi index of Date and Region with total product sold as values

1. no we can't create a multi-index table uisng pivot table
2. df1.pivot_table(index=['Date','Region'],columns='Product',values='Quantity',aggfunc='sum')
3. df1.pivot_table(index=['Date','Region'],columns='Product',values='Quantity',agg='sum')
4. None of these

#### option 2 is correct

In [114]:
#The syntax creates a pivot table with a multi-index of 'Date' and 'Region', using 'Product' as columns, and values as the sum of quantities sold.

In [115]:
df1.pivot_table(index=['Date','Region'],columns='Product',values='Quantity',aggfunc='sum') ## by using pivot_table we can create multiple indexes

Product            Binder  Notebook   Pen
Date       Region
2024-01-10 East       NaN       7.0   NaN
           North      NaN       5.0   NaN
2024-01-11 North     20.0       NaN   NaN
           South      NaN       NaN  10.0
2024-01-12 East      10.0       NaN   NaN
           West       NaN       NaN  15.0

### 27 ) what does the margins parameter in the pivot_table( ) function allow you to include in the pivot table ?

1. additional margins and subtotals for rows and columns.
2. a list of column names to exclude from the pivot table
3. the number of rows and columns to skip at the bigginning of the pivot table 
4. the maximum number of rows and columns to display in the pivot table 

#### option 1 is correct

In [116]:
#The margins parameter in pivot_table() adds subtotals for rows and columns, providing additional summary information in the pivot table.

In [117]:
import pandas as pd

In [118]:
df2 = pd.DataFrame({
    'Fruits': ['apple', 'banana', 'apple', 'apple', 'banana', 'apple', 'kiwi', 'kiwi', 'banana', 'apple', 'kiwi', 'apple', 'banana', 'grape', 'apple', 'banana', 'apple', 'apple', 'grape'],
    'Price': ['', '', 205, 200, 40, 210, 300, 320, '', 180, 350, '', 35, '', 215, 40, '', '', '']
})
df2

    Fruits Price
0    apple
1   banana
2    apple   205
3    apple   200
4   banana    40
5    apple   210
6     kiwi   300
7     kiwi   320
8   banana
9    apple   180
10    kiwi   350
11   apple
12  banana    35
13   grape
14   apple   215
15  banana    40
16   apple
17   apple
18   grape

In [119]:
df3=df2

In [120]:
df3

    Fruits Price
0    apple
1   banana
2    apple   205
3    apple   200
4   banana    40
5    apple   210
6     kiwi   300
7     kiwi   320
8   banana
9    apple   180
10    kiwi   350
11   apple
12  banana    35
13   grape
14   apple   215
15  banana    40
16   apple
17   apple
18   grape

### 28 ) if we choose to impute missing values in price col by chaining ffill() and bfill() while limiting the imputation to 1,1 respectively,how many missing values will be left post imputation ?

1. 2
2. 0
3. 1
4. 3

#### option 3 is correct

In [121]:
#Chaining ffill() and bfill() with a limit of 1 each fills consecutive missing values in the 'Price' column, leaving one missing value after imputation.

In [122]:
df2['Price'] = pd.to_numeric(df2['Price'])
df2['Price'] = df2['Price'].ffill(limit=1).bfill(limit=1) ## ffill is forward filling,bfill backward fill 
df2 ## limit =1 is for it only fill one value in both ffill and bfill

    Fruits  Price
0    apple    NaN
1   banana  205.0
2    apple  205.0
3    apple  200.0
4   banana   40.0
5    apple  210.0
6     kiwi  300.0
7     kiwi  320.0
8   banana  320.0
9    apple  180.0
10    kiwi  350.0
11   apple  350.0
12  banana   35.0
13   grape   35.0
14   apple  215.0
15  banana   40.0
16   apple   40.0
17   apple    NaN
18   grape    NaN

### 29 ) what kind of missing values handling technique is appropriate for df2?
1. imputing price col with Price's mean.
2. impution price col with prices median.
3. imputation price col with individuals fruits'prices median
4. dropping missing values

#### option 3 is correct

In [123]:
#Imputing the 'Price' column in df2 with individual fruits' prices median is appropriate for a more specific and accurate handling of missing values.

In [124]:
df2

    Fruits  Price
0    apple    NaN
1   banana  205.0
2    apple  205.0
3    apple  200.0
4   banana   40.0
5    apple  210.0
6     kiwi  300.0
7     kiwi  320.0
8   banana  320.0
9    apple  180.0
10    kiwi  350.0
11   apple  350.0
12  banana   35.0
13   grape   35.0
14   apple  215.0
15  banana   40.0
16   apple   40.0
17   apple    NaN
18   grape    NaN

In [125]:
df3['Price'] = pd.to_numeric(df2['Price'])#converting to numeric
df3['Price'] = df2.groupby('Fruits')['Price'].transform(lambda x: x.fillna(x.mean()))
df3

    Fruits  Price
0    apple  200.0
1   banana  205.0
2    apple  205.0
3    apple  200.0
4   banana   40.0
5    apple  210.0
6     kiwi  300.0
7     kiwi  320.0
8   banana  320.0
9    apple  180.0
10    kiwi  350.0
11   apple  350.0
12  banana   35.0
13   grape   35.0
14   apple  215.0
15  banana   40.0
16   apple   40.0
17   apple  200.0
18   grape   35.0

### 30 ) if we choose to impute missing values in price col by with individual fruits prices mean how many missing values will be post imputatiion ? 

1. 2
2. 0
3. 1
4. 3

#### option 2 is correct

In [126]:
#Imputing missing values in the 'Price' column with the mean of individual fruits' prices fills all missing values, resulting in none left post-imputation.

# 31 ) if a = pd.Series([np.nan,1,2,np.nan,np.nan,np.nan,np.nan,4,5,7])what will be the output of a interpolate()
a)[nan,1.0,2.0,2.3,2.7,3.1,3.5,4.0,5.0,7.0]

b)[nan,1.0,2.0,2.5,2.9,3.3,3.8,4.0,5.0,7.0]

c)[nan,1.0,2.0,2.4,2.8,3.2,3.6,4.0,5.0,7.0]

d)Error
#### option c is correct

In [127]:
a = pd.Series ([np.nan,1,2,np.nan,np.nan,np.nan,np.nan,4,5,7])

In [128]:
a.interpolate()#The interpolate() function fills missing values in the series 'a' using linear interpolation, resulting in a sequence with smoothly estimated values.

0    NaN
1    1.0
2    2.0
3    2.4
4    2.8
5    3.2
6    3.6
7    4.0
8    5.0
9    7.0
dtype: float64

### 32 ) what is the use of the normalization parameter in the crosstab method pf pandas ?

1. it is used to normalize values by dividing them by the total count
2. to add margings 
3. there is no parameter called as normalize in crosstab.
4. Both a&c

#### option 1 is correct

In [129]:
# explanation :

# It is used to normalize values by dividing them by the total count:
# This statement is true. The normalize parameter in the crosstab method of pandas allows to normalize the values by dividing them by the total count, which can be useful for obtaining percentages or proportions.